# 1、利用while循环：计算1-100之间数字的累加和
#                  计算1-100之间偶数的累加和
#                  计算1-100之间奇数的累加和
# 2、利用for循环：计算1-100之间数字的累加和
#                计算1-100之间偶数的累加和
#                计算1-100之间奇数的累加和
# 3、打印如下图案:0 0 0 0 0
#                1 1 1 1 1 
#                2 2 2 2 2 
#                3 3 3 3 3
#                4 4 4 4 4
count = 1
# 第1题
print("=" * 13,f"第{count}题","=" * 13)
sum,sum1,sum2,i = 0,0,0,0
while i < 100:
    sum += i * 2 + 1
    sum1 += i
    sum2 += i + 1
    i += 2
sum += 100
sum1 += 100
print(f"1-100之间数字的累加和为：{sum}\n\
1-100之间偶数的累加和为：{sum1}\n\
1-100之间奇数的累加和为：{sum2}")
count += 1

# 第2题
print("=" * 13,f"第{count}题","=" * 13)
sum,sum1,sum2,i = 0,0,0,0
for i in range(0,100,2):
    sum += 2 * i + 1
    sum1 += i
    sum2 += i + 1
sum += 100
sum1 += 100
print(f"1-100之间数字的累加和为：{sum}\n\
1-100之间偶数的累加和为：{sum1}\n\
1-100之间奇数的累加和为：{sum2}")
count += 1

# 第3题
print("=" * 13,f"第{count}题","=" * 13)
for i in range(5):
    for j in range(5):
        print(i,end=" ")
    print("")